# Modulo 4: Análisis y depuración de datos con Pandas

Pandas es un paquete de Python que facilita el análisis de datos, proporcionando estructuras de datos rápidas, flexibles y expresivas que hacen el trabajo mucho más intuitivo.

## Importando los paquetes necesarios

In [8]:
import numpy as np
import pandas as pd

## Creación de variables
Primero creamos las variables a analizar.

In [42]:
Vendedor=np.array(["María","Juana","Maria","Jose","Maria","Juana","Maria","Jose","Maria","Juana"])
Venta=np.array([3000,4000,5000,2000,6000,7000,10000,7000,3000,6000])
Descuento=np.array([0.10,0.20,0.5,0.6,0.8,np.nan,0.3,0.2,0.1,0.10])

## Dataframe
Un dataframe es un tipo especial de objeto de python cuya estructura permite almacenar un conjunto de datos. Los datos almacenados pueden ser de diversos tipos tanto numéricos y alfanuméricos. Su representación es muy similar a la de una matriz, en donde, las filas van a representar a los individuos y las columnas a las variables.

In [43]:
# Crear el diccionario
data = {'Vendedor':Vendedor, 'Ventas':Venta, 'Descuentos':Descuento}

# Crear el dataframe
df = pd.DataFrame(data)

# Leer df
df

  Vendedor  Ventas  Descuentos
0    María    3000         0.1
1    Juana    4000         0.2
2    Maria    5000         0.5
3     Jose    2000         0.6
4    Maria    6000         0.8
5    Juana    7000         NaN
6    Maria   10000         0.3
7     Jose    7000         0.2
8    Maria    3000         0.1
9    Juana    6000         0.1

Tamaño del dataframe

In [44]:
df.shape  # filas por columnas

(10, 3)

Eliminación de valores perdidos. (En lugar de eliminarlo que es con dropna, mejor voy a rellenar el NaN con 0)

In [45]:
df['Descuentos'].fillna(0, inplace=True)
df

  Vendedor  Ventas  Descuentos
0    María    3000         0.1
1    Juana    4000         0.2
2    Maria    5000         0.5
3     Jose    2000         0.6
4    Maria    6000         0.8
5    Juana    7000         0.0
6    Maria   10000         0.3
7     Jose    7000         0.2
8    Maria    3000         0.1
9    Juana    6000         0.1

Visualización del dataframe df

In [46]:
df.head(5)

  Vendedor  Ventas  Descuentos
0    María    3000         0.1
1    Juana    4000         0.2
2    Maria    5000         0.5
3     Jose    2000         0.6
4    Maria    6000         0.8

In [47]:
# Agregar dos columnas más (Aportes y Turno)

# numero filas del df
num_filas = df.shape[0]

# Agregar aportes:
df['Aportes'] = np.random.uniform(0.03, 0.20, num_filas)

# Agregar turno:
df['Turno'] = np.random.choice(['Nocturno', 'Diurno'], num_filas)

df.head(5)

  Vendedor  Ventas  Descuentos   Aportes     Turno
0    María    3000         0.1  0.113978  Nocturno
1    Juana    4000         0.2  0.047433  Nocturno
2    Maria    5000         0.5  0.197640    Diurno
3     Jose    2000         0.6  0.165515  Nocturno
4    Maria    6000         0.8  0.102694  Nocturno

In [49]:
df.dtypes

Vendedor       object
Ventas          int32
Descuentos    float64
Aportes       float64
Turno          object
dtype: object

### Manipulación del dataframe

Acceso a los elementos del dataframe:


*   **iloc:** Acceso a los elementos por los índices expresados en filas y columnas. 
*   **loc:** Acceso a las filas con condiciones

Filas: primer elemento

In [14]:
df.iloc[0]

Vendedor      María
Ventas         3000
Descuentos      0.1
Name: 0, dtype: object

Último elemento

In [15]:
df.iloc[-1]

Vendedor      Juana
Ventas         6000
Descuentos      0.1
Name: 9, dtype: object

Filas y columnas: Seleccione los registros 0 y 3 y la primera y segunda columna

In [17]:
df.iloc[[0,3],[0,1]]

  Vendedor  Ventas
0    María    3000
3     Jose    2000

Columnas

In [18]:
df['Vendedor']

0    María
1    Juana
2    Maria
3     Jose
4    Maria
5    Juana
6    Maria
7     Jose
8    Maria
9    Juana
Name: Vendedor, dtype: object

Seleccione las ventas hechas por María en horario nocturno

In [22]:
df[(df['Vendedor'] == 'María')]  ### y el turno??

  Vendedor  Ventas  Descuentos
0    María    3000         0.1

Otras formas de selección

#### Seleccionar los primeros cinco individuos

#### Seleccionar las variables Vendedor y Venta

In [24]:
df[['Vendedor','Ventas']]

  Vendedor  Ventas
0    María    3000
1    Juana    4000
2    Maria    5000
3     Jose    2000
4    Maria    6000
5    Juana    7000
6    Maria   10000
7     Jose    7000
8    Maria    3000
9    Juana    6000

#### Filtrar los datos por algún valor

Seleccionar las ventas de María

In [ ]:
# ya

Seleccionar las ventas realizadas por Maria y Jose

In [27]:
df[(df['Vendedor'] == 'Maria') | (df['Vendedor'] == 'Jose')]   # importante el operador logico, o and (&) o or (|)

  Vendedor  Ventas  Descuentos
2    Maria    5000         0.5
3     Jose    2000         0.6
4    Maria    6000         0.8
6    Maria   10000         0.3
7     Jose    7000         0.2
8    Maria    3000         0.1

Seleccionar las ventas con descuento mayor al 20%

In [33]:
df[(df['Descuentos'] > 0.2)]

  Vendedor  Ventas  Descuentos
2    Maria    5000         0.5
3     Jose    2000         0.6
4    Maria    6000         0.8
6    Maria   10000         0.3

Eliminar el registro indexado con 7

In [34]:
df

  Vendedor  Ventas  Descuentos
0    María    3000         0.1
1    Juana    4000         0.2
2    Maria    5000         0.5
3     Jose    2000         0.6
4    Maria    6000         0.8
5    Juana    7000         0.0
6    Maria   10000         0.3
7     Jose    7000         0.2
8    Maria    3000         0.1
9    Juana    6000         0.1

In [39]:
df.index

df.drop(7, inplace=True)
df

  Vendedor  Ventas  Descuentos
0    María    3000         0.1
1    Juana    4000         0.2
2    Maria    5000         0.5
3     Jose    2000         0.6
4    Maria    6000         0.8
5    Juana    7000         0.0
6    Maria   10000         0.3
8    Maria    3000         0.1
9    Juana    6000         0.1

Eliminar la columna vendedor

In [40]:
df = df.drop('Vendedor', axis=1)
df

   Ventas  Descuentos
0    3000         0.1
1    4000         0.2
2    5000         0.5
3    2000         0.6
4    6000         0.8
5    7000         0.0
6   10000         0.3
8    3000         0.1
9    6000         0.1

#### Agregar datos

Agregar el dato:

Jose    "8000"  "0.20"    "0.01"    "Nocturno"

### Guardar y cargar un dataframe

Guardar el dataframe como un archivo pickled, tenga en cuenta en ser muy cuidadoso

In [50]:
# pickled son extensiones propias de python, es mejor compartir archivos con esa extensión .plk

df.to_pickle(r'C:\Carrera de Datos\Data Scientist\Diplomado Python EAN\Archivos\data_ventas.plk')

Cargar el archivo pickled

In [51]:
df_copia = pd.read_pickle(r'C:\Carrera de Datos\Data Scientist\Diplomado Python EAN\Archivos\data_ventas_copia_para_leer.plk')
df_copia.head(5)

  Vendedor  Ventas  Descuentos
0    María    3000         0.1
1    Juana    4000         0.2
2    Maria    5000         0.5
3     Jose    2000         0.6
4    Maria    6000         0.8

### Exportar archivos

In [53]:
# Exportar a otro tipo de archivos
df.to_excel(r'C:\Carrera de Datos\Data Scientist\Diplomado Python EAN\Archivos\ventas_excel.xlsx')

### Importar archivos

In [ ]:
#pd.read_csv("G:\Mi unidad\EAN_Documentos\Python Agosto\Ventas.csv",sep="\t")
#datos=pd.read_excel("G:\Mi unidad\EAN_Documentos\Python Agosto\VentasXls.xlsx", sheetname='VentasXls')
#datos

## Taller

Cree un dataframe con el nombre df1 con los siguientes datos:

Jose     "6000"  "0.20"    "0.01"    "Nocturno"\
Maria    "6500"  "0.10"    "0.02"    "Diurno"\
Juana    "4000"  "0.30"    "0.03"    "Diurno"\
Jose     "2000"  "0.10"    "0.02"    "Diurno"\
Juana    "1500"  "0.30"    "0.03"    "Diurno"

Una estos datos al anterior dataframe utilizando el comando

df.append(df1, ignore_index = True)

Creación elementos del Dataframe

In [36]:
jose1=['Jose',6000,0.20,0.01,'Nocturno']
maria=['María',6500,0.10,0.02,'Diurno']
juana=['Juana',4000,0.30,0.03,"Diurno"]
jose=['Jose',2000,0.10,0.02,"Diurno"]
juana1=['juana',1500,0.30,0.03,"Diurno"]

Creación del DataFrame

In [37]:
data_taller = {'Jose1':jose1, 'Maria':maria, 'Juana':juana, 'Jose':jose, 'Juana1':juana1}
df_taller = pd.DataFrame(data_taller)
df_taller.head(5)

      Jose1   Maria   Juana    Jose  Juana1
0      Jose   María   Juana    Jose   juana
1      6000    6500    4000    2000    1500
2       0.2     0.1     0.3     0.1     0.3
3      0.01    0.02    0.03    0.02    0.03
4  Nocturno  Diurno  Diurno  Diurno  Diurno

Transponer el DataFrame

In [38]:
df_taller = df_taller.T
df_taller

            0     1    2     3         4
Jose1    Jose  6000  0.2  0.01  Nocturno
Maria   María  6500  0.1  0.02    Diurno
Juana   Juana  4000  0.3  0.03    Diurno
Jose     Jose  2000  0.1  0.02    Diurno
Juana1  juana  1500  0.3  0.03    Diurno

Renombrar elementos del Dataframe

In [39]:
df_taller = df_taller.rename(columns={
    0: 'Vendedor',
    1: 'Ventas',
    2: 'Descuentos',
    3: 'Aportes',
    4: 'Turno'
})

df_taller.head(5)

       Vendedor Ventas Descuentos Aportes     Turno
Jose1      Jose   6000        0.2    0.01  Nocturno
Maria     María   6500        0.1    0.02    Diurno
Juana     Juana   4000        0.3    0.03    Diurno
Jose       Jose   2000        0.1    0.02    Diurno
Juana1    juana   1500        0.3    0.03    Diurno

Renombrar índices

In [40]:
#Esto para eliminar columna:

#df_taller = df_taller.drop(df_taller.columns[0],axis=1)
#df_taller.head(5)

df_taller.index = np.arange(1,len(df_taller) + 1)

df_taller.head(5)

  Vendedor Ventas Descuentos Aportes     Turno
1     Jose   6000        0.2    0.01  Nocturno
2    María   6500        0.1    0.02    Diurno
3    Juana   4000        0.3    0.03    Diurno
4     Jose   2000        0.1    0.02    Diurno
5    juana   1500        0.3    0.03    Diurno

In [55]:
df.dtypes

Vendedor       object
Ventas          int32
Descuentos    float64
Aportes       float64
Turno          object
dtype: object

In [57]:
df_taller = df.astype({
    'Ventas': 'int32',
    'Descuentos': 'float64',
    'Aportes': 'float64'
})

In [58]:
df_taller.dtypes

Vendedor       object
Ventas          int32
Descuentos    float64
Aportes       float64
Turno          object
dtype: object

Unión de lo DataFrames

In [64]:
#df_unido = df_taller.append(df)  Va a desaparecer
df_unido = pd.concat([df_taller, df])
df_unido.index = np.arange(1,len(df_unido) + 1)
df_unido

   Vendedor  Ventas  Descuentos   Aportes     Turno
1     María    3000         0.1  0.113978  Nocturno
2     Juana    4000         0.2  0.047433  Nocturno
3     Maria    5000         0.5  0.197640    Diurno
4      Jose    2000         0.6  0.165515  Nocturno
5     Maria    6000         0.8  0.102694  Nocturno
6     Juana    7000         0.0  0.058078    Diurno
7     Maria   10000         0.3  0.156111    Diurno
8      Jose    7000         0.2  0.076902    Diurno
9     Maria    3000         0.1  0.167485  Nocturno
10    Juana    6000         0.1  0.037298    Diurno
11    María    3000         0.1  0.113978  Nocturno
12    Juana    4000         0.2  0.047433  Nocturno
13    Maria    5000         0.5  0.197640    Diurno
14     Jose    2000         0.6  0.165515  Nocturno
15    Maria    6000         0.8  0.102694  Nocturno
16    Juana    7000         0.0  0.058078    Diurno
17    Maria   10000         0.3  0.156111    Diurno
18     Jose    7000         0.2  0.076902    Diurno
19    Maria    3000         0.1  0.167485  Nocturno
20    Juana    6000         0.1  0.037298    Diurno

In [65]:
df_unido.dtypes

Vendedor       object
Ventas          int32
Descuentos    float64
Aportes       float64
Turno          object
dtype: object

## Cálculo de las principales medidas estadísticas

### Variables numéricas

Medidas de tendencia central: Media.

Medidas de dispersión: Desviación estándar
Medidas de posición: cuartiles

Análisis de todas las variables cuantitativas

In [67]:
pd.set_option('display.float_format', '{:.1f}'.format)

df_unido.describe()

       Ventas  Descuentos  Aportes
count    20.0        20.0     20.0
mean   5300.0         0.3      0.1
std    2341.8         0.3      0.1
min    2000.0         0.0      0.0
25%    3000.0         0.1      0.1
50%    5500.0         0.2      0.1
75%    7000.0         0.5      0.2
max   10000.0         0.8      0.2

De algunas variables

Medidas individuales

Obtención de medidas por agrupación

Obtención de medidas por agrupación de varias variables.

In [ ]:
##Calculo de la desviación estándar

Cálculo de dos medidas estadísticas

### Variables cualitativas

El commando describe presenta la cantidad de datos de la variable, la cantidad de valores distintos, la moda y la frecuencia.

### Frecuencias absolutas

Cantidad de individuos que poseen la característica.

### Frecuencias relativas

Porcentaje de individuos que poseen la característica

### Tablas de Contingencia

#### Frecuencias absolutas

Cantidad de individuos que toman valores en dos variables 
distintas.

#### Frecuencias relativas

Porcentaje de individuos que toman valores en dos variables distintas.

#### Frecuencias relativas por vendedor

Porcentaje de veces que un vendedor estuvo en determinado horario.

#### Frecuencias relativas por horario

Porcentaje de veces que en un horario estuvo un vendedor.